<?php
//基础先攻率（N空手；P殴系；K斩系；G射系；g没子弹的射；C投系；D爆系；F灵系）
$active_obbs = Array('N' => 55, 'P' => 50, 'K' => 50, 'G' => 45, 'g' => 25, 'C' => 60, 'D' => 50, 'F'=> 50);
//$active_obbs = Array('N' => 60, 'P' => 55, 'K' => 55, 'G' => 45, 'g' => 30, 'C' => 60, 'D' => 65, 'F'=> 55);
//基础反击率
$counter_obbs =  Array('N' => 55, 'P' => 50, 'K' => 50, 'G' => 40, 'g' => 25, 'C' => 65, 'D' => 0, 'F'=> 55);
//$counter_obbs =  Array('N' => 60, 'P' => 60, 'K' => 60, 'G' => 50, 'g' => 30, 'C' => 70, 'D' => 0, 'F'=> 60);
//各种攻击方式的克制属性
$wep_def = Array('N' => 'DN', 'P' => 'DP', 'K'=>'DK','G' => 'DG','g' => 'DP','C' => 'DC','D'=>'DD','F'=>'DF');
//各种攻击方式的射程，射程大者可以反击射程小者，此外射程为0则代表不能反击任何系但也不能被任何系反击
$rangeinfo = Array('N' => 3, 'P' => 3, 'K' => 3, 'G' => 7, 'g' => 2, 'C' => 5, 'D' => 0, 'F'=> 1); 
//各种攻击方式的基础命中率
$hitrate_obbs = Array('N' => 80, 'P' => 75, 'K' => 70, 'G' => 60,'g' => 40, 'C' => 60, 'D' => 50, 'F' => 85);
//$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 75, 'G' => 70,'g' => 45, 'C' => 70, 'D' => 60, 'F' => 85);
//$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 80, 'G' => 75, 'C' => 100, 'D' => 60, 'F' => 70);
//各种攻击方式的最高命中率
$hitrate_max_obbs = Array('N' => 90, 'P' => 85, 'K' => 85, 'G' => 95,'g' => 60, 'C' => 95, 'D' => 70, 'F' => 95);
//熟练度对命中的影响，每点熟练增加的命中，可以考虑区分武器
$hitrate_r =  Array('N' => 0.025, 'P' => 0.025, 'K' => 0.025, 'G' => 0.05,'g' => 0.025, 'C' => 0.3, 'D' => 0.05, 'F'=> 0.2);
//$hitrate_r =  Array('N' => 0.02, 'P' => 0.02, 'K' => 0.02, 'G' => 0.01, 'C' => 0, 'D' => 0.03, 'F'=> 0.05);
//各种攻击方式的伤害变动范围，越少越稳定。
$dmg_fluc = Array('N' => 15, 'P' => 15, 'K' => 40, 'G' => 20,'g' => 12, 'C' => 5, 'D' => 25, 'F'=> 10);
//熟练度对伤害的影响，每点熟练度增加的伤害
$skill_dmg = Array('N' => 0.6, 'P' => 0.6, 'K' => 0.65, 'G' => 0.6 ,'g' => 0.5, 'C' => 0.4, 'D' => 0.75, 'F'=> 0.4);
//$skill_dmg = Array('N' => 0.5, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.3, 'D' => 0.4, 'F'=> 1.2);

//各种攻击方式可能导致受伤的部位
//$infatt = Array('N' => '', 'P' => 'ha', 'K' =>'bha', 'G' =>'bhaf', 'C'=> 'ha', 'D' => 'bhaf', 'F'=> 'bhaf');
//各种攻击方式的致伤率
$infobbs = Array('N' => 5, 'P' => 15, 'K' => 35, 'G' => 20, 'g' => 15, 'C' => 10, 'D' => 45, 'F' => 30);
//$infobbs = Array('N' => 5, 'P' => 15, 'K' => 30, 'G' => 30, 'C' => 15, 'D' => 40, 'F' => 30);
//各种攻击方式的武器损伤概率
$wepimprate = Array('N' => -1, 'P' => 12, 'K' => 30, 'G' => -1, 'g' => 75, 'C' => -1, 'D' => -1, 'F' => -1);

//击中各个部位对伤害的影响
$region_dmg_fac = Array('h' => 1.2, 'b' => 1, 'a' => 0.8, 'f' => 0.7);
//击中各个部位的概率
$region_hit_r = Array('h' => 15, 'b' => 35, 'a' => 30, 'f' => 20);
//各种防具且具备克制属性的时候，武器伤害的因数
$ar_wep_def_fac = Array('DH' => 0.6, 'DB' => 0.5, 'DA' => 0.7, 'DF' => 0.65);
//各种防具且具备克制属性的时候，削减武器伤害的概率
$ar_wep_def_r = Array('DH' => 80, 'DB' => 90, 'DA' => 70, 'DF' => 75);
//装备防具后，防御受伤的基础概率
$arinf_base_r = Array('h' => 20, 'b' => 30, 'a' => 10, 'f' => 20);
//装备防具后，防御受伤的最高概率
$arinf_max_r = Array('h' => 80, 'b' => 90, 'a' => 80, 'f' => 70);
//装备防具后，每点效果值增加的防御受伤概率
$arinf_eff = Array('h' => 0.5, 'b' => 0.6, 'a' => 0.3, 'f' => 0.4);

//属性攻击登录
$ex_attack = Array('p', 'u', 'i', 'd', 'e', 'w', 's', 'S');
//各种属性攻击的得意武器（ 伤害1.5倍）
$ex_good_wep = Array('p' => 'K','u' => 'G','i'=> 'C','d' => 'D', 'e' => 'P', 'w' => '', 's' => '', 'S' => 'F');
//各种属性攻击的得意社团（致伤命中率+20）
$ex_good_club = Array('p' => 8,'u' => -1,'i' => -1,'d' => -1,'e' => 7,'w' => -1,'s' => -1,'S' => -1);
//各种属性攻击的克制属性
$ex_dmg_def = Array('p' => 'Dp', 'u' => 'Du', 'i'=>'Di','d' => 'DD','e' => 'De','w'=>'Dw','s'=>'Dw','S'=>'DS');
//各种属性攻击的克制属性的防御力指数
$ex_dmg_def_index = Array('p' => 10, 'u' => 8, 'i'=> 15, 'd'=> 5,'e' => 15,'w' => 12,'s' => 15,'S' => 20);
//各种属性攻击的伤害因数，0指爆炸类保证伤害值
$ex_dmg_fac = Array('p' => 1.15, 'u' => 1.25, 'i'=> 1.1, 'd'=> 0,'e' => 1.2,'w' => 1.1,'s' => 1.05,'S' => 1.05);

//各种属性攻击的基础伤害值
//$ex_base_dmg = Array('p' => 15, 'u' => 25, 'i'=> 10, 'd'=> 1,'e' => 15,'w' => 20);
//各种属性攻击的最大伤害值，游戏中，属性攻击伤害不会超过这个参数，0则不限制伤害
//$ex_max_dmg = Array('p' => 90, 'u' => 120, 'i'=> 80, 'd'=> 0,'e' => 100,'w' => 100);
//每点武器攻击力对属性攻击的影响
//$ex_wep_dmg = Array('p' => 0.1, 'u' => 0.2, 'i'=> 0.075,'d' => 0.5,'e' => 0.1,'w' => 0.08);
//每点熟练度对属性攻击的影响
//$ex_skill_dmg = Array('p' => 0.075, 'u' => 0.05, 'i'=> 0.05,'d' => 0.02,'e' => 0.05,'w' => 0.06);
//各种属性攻击的伤害浮动范围
$ex_dmg_fluc = Array('p' => 15, 'u' => 30, 'i'=> 10,'d'=> 20,'e' => 5,'w' => 15,'s' => 10,'S' => 10);
//属性攻击导致的异常状态登录
$ex_inf = Array('p' => 'p', 'u' => 'u', 'i'=> 'i','e' => 'e','w' => 'w', 's' => 's','S' => 'S');

//已经进入异常状态对属性攻击伤害因数的影响
$ex_inf_dmg_fac = Array('p' => 1.5, 'u' => 1, 'i'=> 0.75,'e' => 1,'w' => 1.2,'s' => 0.6,'S' => 0.5);

//已经进入异常状态对属性攻击伤害的影响
//$ex_inf_punish = Array('p' => 2, 'u' => 1, 'i'=> 0.75,'e' => 1,'w'=>1.5);
//各种属性攻击的初始致异常状态率
$ex_inf_r = Array('p' => 5, 'u' => 10, 'i'=> 5,'e' => 5,'w'=> 10, 's' => 15, 'S' => 5);
//各种属性攻击的最高致异常状态率
$ex_max_inf_r = Array('p' => 60, 'u' => 40, 'i'=> 50,'e' => 50,'w'=> 65, 's' => 50, 'S' => 25);
//熟练度对致异常状态率的影响
$ex_skill_inf_r = Array('p' => 0.1, 'u' => 0.05, 'i'=> 0.08,'e' => 0.08,'w'=> 0.12,'s'=> 0.1, 'S' => 0.04);
//各种属性陷阱的致异常状态率
$ex_trap_inf_r = Array('p' => 25, 'u' => 20, 'i'=> 15,'e' => 20,'w'=> 20, 's'=> 25, 'S' => 10);

//各种受伤状态对战斗攻击力的影响因子
$inf_att_p = Array('a'=> 0.75,'u'=> 0.6);
//各种受伤状态对战斗防御力的影响因子
$inf_def_p = Array('b'=> 0.75,'i'=> 0.9,'w'=> 0.7 , 's'=> 0.75, 'S' => 4, 'L'=> 0.75);
//各种受伤状态对战斗命中率的影响因子
$inf_htr_p = Array('h' => 0.75,'i'=> 0.8,'e' => 0.9, 'L'=> 0.75);
//各种受伤状态对战斗先攻率的影响因子
$inf_active_p = Array('i'=> 0.9,'e' => 0.25,'w'=> 0.8,'s'=> 0,'S' => 0, 'L'=> 0.75);
//各种受伤状态对战斗反击率的影响因子
$inf_counter_p = Array('i'=> 0.9,'e' => 0.25,'w'=> 0.8,'s'=> 0,'S' => 0, 'L'=> 0.75);

?>