<?php
//基础反击率
$counter_obbs =  Array('N' => 50, 'P' => 50, 'K' => 50, 'G' => 50, 'C' => 50, 'D' => 50, 'F'=> 50);

//各种攻击方式的基础命中率
$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 75, 'G' => 70, 'C' => 70, 'D' => 60, 'F' => 90);
//$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 80, 'G' => 75, 'C' => 100, 'D' => 60, 'F' => 70);
//各种攻击方式的最高命中率
$hitrate_max_obbs = Array('N' => 90, 'P' => 90, 'K' => 85, 'G' => 95, 'C' => 95, 'D' => 70, 'F' => 95);
//熟练度对命中的影响，每点熟练增加的命中，可以考虑区分武器
$hitrate_r =  Array('N' => 0.025, 'P' => 0.025, 'K' => 0.025, 'G' => 0.05, 'C' => 0.2, 'D' => 0.02, 'F'=> 0.02);
//$hitrate_r =  Array('N' => 0.02, 'P' => 0.02, 'K' => 0.02, 'G' => 0.01, 'C' => 0, 'D' => 0.03, 'F'=> 0.05);
//各种攻击方式的伤害变动范围，越少越稳定。
$dmg_fluc = Array('N' => 15, 'P' => 15, 'K' => 40, 'G' => 20, 'C' => 5, 'D' => 25, 'F'=> 10);
//熟练度对伤害的影响，每点熟练增加的伤害
$skill_dmg = Array('N' => 0.6, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.2, 'D' => 0.8, 'F'=> 0.3);
//$skill_dmg = Array('N' => 0.5, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.3, 'D' => 0.4, 'F'=> 1.2);

//各种攻击方式可能导致受伤的部位
$infatt = Array('N' => '', 'P' => 'ha', 'K' =>'bha', 'G' =>'bhaf', 'C'=> 'ha', 'D' => 'bhaf', 'F'=> 'bhaf');
//各种攻击方式的致伤率
$infobbs = Array('N' => 5, 'P' => 15, 'K' => 35, 'G' => 20, 'C' => 10, 'D' => 45, 'F' => 30);
//$infobbs = Array('N' => 5, 'P' => 15, 'K' => 30, 'G' => 30, 'C' => 15, 'D' => 40, 'F' => 30);
//各种攻击方式的武器损伤概率
$wepimprate = Array('N' => -1, 'P' => 12, 'K' => 25, 'G' => -1, 'C' => -1, 'D' => -1, 'F' => -1);

//各种属性攻击的克制属性
$ex_dmg_def = Array('p' => 'q', 'u' => 'U', 'i'=>'I');
//各种属性攻击的伤害参数，越大则伤害越大
$ex_base_dmg = Array('p' => 100, 'u' => 250, 'i'=> 75);
//各种属性攻击的伤害武器参数，越小伤害上升越快
$ex_wep_dmg = Array('p' => 100, 'u' => 60, 'i'=> 300);
//各种属性攻击的伤害熟练参数，越小伤害上升越快
$ex_skill_dmg = Array('p' => 800, 'u' => 1000, 'i'=> 1500);
//各种属性攻击的伤害浮动范围
$ex_dmg_fluc = Array('p' => 20, 'u' => 30, 'i'=> 15);
//已经进入异常状态对属性攻击伤害的影响
$ex_inf_punish = Array('p' => 2, 'u' => 1, 'i'=> 0.5);
//各种属性攻击的初始致异常状态率
$ex_inf_r = Array('p' => 10, 'u' => 25, 'i'=> 25);
//各种属性攻击的最高致异常状态率
$ex_max_inf_r = Array('p' => 60, 'u' => 40, 'i'=> 75);
//熟练度对致异常状态率的影响
$ex_skill_inf_r = Array('p' => 0.2, 'u' => 0.03, 'i'=> 0.1);


?>