<?php
//基础反击率
$counter_obbs =  Array('N' => 50, 'P' => 50, 'K' => 50, 'G' => 50, 'C' => 50, 'D' => 50, 'F'=> 30);

//各种攻击方式的基础命中率
$hitrate_obbs = Array('N' => 80, 'P' => 80, 'K' => 80, 'G' => 75, 'C' => 100, 'D' => 60, 'F' => 70);
//熟练度对命中的影响，每点熟练增加的命中，可以考虑区分武器
$hitrate_r =  Array('N' => 0.02, 'P' => 0.02, 'K' => 0.02, 'G' => 0.01, 'C' => 0, 'D' => 0.03, 'F'=> 0.05);

//熟练度对伤害的影响，每点熟练增加的伤害
$skill_dmg = Array('N' => 0.5, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.3, 'D' => 0.4, 'F'=> 1.2);

//各种攻击方式可能导致受伤的部位
$infatt = Array('N' => '', 'P' => 'ha', 'K' =>'bha', 'G' =>'bhaf', 'C'=> 'ha', 'D' => 'bhaf', 'F'=> 'bhaf');
//各种攻击方式的致伤率
$infobbs = Array('N' => 0, 'P' => 15, 'K' => 30, 'G' => 30, 'C' => 15, 'D' => 40, 'F' => 30);


?>