<?php
/*Game Config*/

//禁区间隔时间,单位 小时
$areahour = 1;
//每次间隔增加的禁区数量
$areaadd = 1;
//玩家激活结束时的增加禁区的回数，相当于已经进行的小时数/间隔时间，〉0
$arealimit = 15;
//是否自动逃避禁区 0=只有重视躲避自动躲避，1=所有玩家自动躲避，适合新手较多，不了解禁区机制
$areaesc = 0;
//是否开启死斗模式 0=关闭,1=开启。连斗后下次禁区，进入死斗状态，死斗后玩家只会遇到玩家，死斗后所有区域都将一次性宣布为禁区。（尚未完成）
$isduel = 0;

//本局游戏人数限制
$validlimit = 150;
//连斗时的人数限制
$combolimit = 15;
//连斗时的死亡人数限制
$deathlimit = 100;
 
// 等级提升基本经验值 
$baseexp = 9;
// 初始耐力最大值 
$splimit = 400;
// 初始生命最大值 
$hplimit = 400;
// 怒气最大值 
$mrage = 500;
//携带金钱上限
$moneylimit = 65500;

// 恢复量的设定
//体力恢复时间(秒):*秒1点恢复
$sleep_time = 1;
//生命恢复时间(秒):*秒1点恢复
$heal_time = 2;
//包扎伤口需要的体力
$inf_sp = 25;
//创建队伍需要的体力
$team_sp = 50;
//加入队伍需要的体力
$teamj_sp = 25;
//队伍最大人数
$teamlimit = 5;

//随机事件几率(百分比)
$event_obbs = 10;
//道具发现基础几率(百分比)
$item_obbs = 60;
//敌人发现基础几率(百分比)
$enemy_obbs = 70;
//尸体发现几率（百分比）
$corpse_obbs = 50;
//基础先攻率
$active_obbs = 50;
//基础反击率
$counter_obbs = 50;
//熟练度对命中的影响，每点熟练增加的命中，可以考虑区分武器
$hitrate_r = 0.02;
//熟练度对伤害的影响，每点熟练增加的伤害，可以考虑区分武器
$skill_dmg = array('N' => 0.5, 'P' => 0.5, 'K' => 0.5, 'G' => 0.6, 'C' => 0.3, 'D' => 0.4, 'F' => 1.2);
//各种攻击方式可能导致受伤的部位
$infatt = Array('N' => '', 'P' => 'ha', 'K' =>'bha', 'G' =>'bhaf', 'C'=> 'ha', 'D' => 'bhaf', 'F' =>'bhaf');
//$infatt = Array('N' => '', 'P' => 'bhaf', 'K' =>'bhaf', 'G' =>'bhaf', 'C'=> 'bhaf', 'D' => 'bhaf');
//各种攻击方式的致伤率
$infobbs = Array('N' => 0, 'P' => 15, 'K' => 30, 'G' => 30, 'C' => 15, 'D' => 40, 'F' => 30);
//$infobbs = Array('N' => 100, 'P' => 100, 'K' => 100, 'G' => 100, 'C' => 100, 'D' => 100);

//hack基础成功率
$hack_obbs = 40;


?>