<? if(!defined('IN_GAME')) exit('Access Denied'); ?>
简易雷达,R,1,∞,1,
简易雷达,R,1,∞,1,
简易雷达,R,1,∞,1,
简易雷达,R,1,∞,1,
毒药,Y,1,1,
毒药,Y,1,1,
毒药,Y,1,1,
毒药,Y,1,1,
苹果酒,HS,50,1, 
鸡尾酒,HS,50,1, 
威士忌酒,HS,60,1,
点心,HS,50,1, 
信管,Y,1,∞, 
子弹,GB,1,15,
地雷,TN,20,1,
水,HS,25,6,
地雷,TN,20,1,
地雷,TN,20,1,
地雷,TN,20,1,
绳索,TN,20,1,
绳索,TN,20,1,
水,HS,25,12, 
子弹,GB,1,15, 
地雷,TN,20,1, 
信管,Y,1,1,
信管,Y,1,1, 
信管,Y,1,1, 
导火线,Y,1,1,
导火线,Y,1,1,
导火线,Y,1,1,
警用盾,DA,5,5, 
戒指,DA,2,3,
手表,DA,5,5,
手链,DA,2,5,
垫肩,DA,5,5,
警用盾,DA,5,5, 
戒指,DA,2,3,
手表,DA,5,5,
手链,DA,2,5,
垫肩,DA,5,5,
警用盾,DA,5,5, 
戒指,DA,2,3,
手表,DA,5,5,
手链,DA,2,5,
垫肩,DA,5,5,
染血的盾牌,DA,7,5, 
吊带裤,DB,10,15, 
围裙,DB,5,15, 
工作装,DB,15,15,  
迷彩服,DB,15,15, 
军用雨衣,DB,15,15, 
吊带裤,DB,10,15, 
围裙,DB,5,15, 
工作装,DB,15,15,
迷彩服,DB,15,15, 
军用雨衣,DB,15,15, 
吊带裤,DB,10,15, 
围裙,DB,5,15, 
工作装,DB,15,15, 
迷彩服,DB,15,15, 
军用雨衣,DB,15,15, 
草帽,DH,5,5, 
太阳眼镜,DH,3,5, 
头巾,DH,3,5,
口罩,DH,3,5,
缎带,DH,3,5, 
草帽,DH,5,5, 
太阳眼镜,DH,3,5, 
头巾,DH,3,5,
口罩,DH,3,5,
缎带,DH,3,5, 
草帽,DH,5,5, 
太阳眼镜,DH,3,5, 
头巾,DH,3,5, 
口罩,DH,3,5,
缎带,DH,3,5,
防灾头巾,DH,3,10, 
运动鞋,DF,5,5, 
滑板,DF,5,5, 
高跟鞋,DF,5,5, 
篮球鞋,DF,5,5, 
钉鞋,DF,5,5, 
运动鞋,DF,5,5, 
滑板,DF,5,5, 
高跟鞋,DF,5,5, 
篮球鞋,DF,5,5, 
钉鞋,DF,5,5, 
运动鞋,DF,5,5, 
滑板,DF,5,5, 
高跟鞋,DF,5,5, 
篮球鞋,DF,5,5, 
钉鞋,DF,5,5, 